# Employee database analysis using MySQL

The following publication serves as a project carried out to obtain insights from the employee database using MySQL queries.

The database consists of tables with employee information like name, gender, hiring date, DOB and other information such as salary, title and department.

Some of the querying skills shown to generate insights are the use of JOINS, AGGREGATE FUNCTIONS, CLAUSES and SUBQUERY.

-- Rohaan Zuberi

## Checking the tables

In [ ]:
SHOW TABLES;

  Tables_in_employees
0         departments
1            dept_emp
2        dept_manager
3           employees
4            salaries
5              titles

## Q1. How many departments are there?

In [ ]:
/* checking to see the distinct department names */
SELECT
    DISTINCT *
    FROM departments;

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

## Q2. How many employees work in each department?

In [ ]:
/* Joining DEPARTMENTS and DEPT_EMP tables to identify how many employees are working in each department */
SELECT
    dept_name AS Department, COUNT(emp_no) AS Employees
    FROM departments
    INNER JOIN dept_emp
    ON departments.dept_no = dept_emp.dept_no
    GROUP BY Department
    ORDER BY Employees DESC;

           Department  Employees
0         Development      85707
1          Production      73485
2               Sales      52245
3    Customer Service      23580
4            Research      21126
5           Marketing      20211
6  Quality Management      20117
7     Human Resources      17786
8             Finance      17346

## Q3. What is the gender profile of employees within the company?

In [ ]:
/* Joining DEPT_EMP and EMPLOYEES table to identify the gender diversity of employees */
SELECT
    COUNT(de.emp_no) AS number_of_employees,
    e.gender
    FROM dept_emp AS de
    INNER JOIN employees AS e
    USING(emp_no)
    GROUP BY gender;

   number_of_employees gender
0               198850      M
1               132753      F

## Q4. What is the gender profile within each department?

In [ ]:
SELECT
    DISTINCT d.dept_name AS Department,
    e.gender AS Gender,
    COUNT(de.emp_no) AS Employee
FROM
	departments AS d
INNER JOIN
	dept_emp AS de
USING(dept_no)
INNER JOIN
	employees AS e
USING (emp_no)
GROUP BY
	Gender,
    Department
ORDER BY
Department;

            Department Gender  Employee
0     Customer Service      M     14132
1     Customer Service      F      9448
2          Development      M     51449
3          Development      F     34258
4              Finance      F      7015
5              Finance      M     10331
6      Human Resources      M     10711
7      Human Resources      F      7075
8            Marketing      M     12174
9            Marketing      F      8037
10          Production      M     43936
11          Production      F     29549
12  Quality Management      F      8078
13  Quality Management      M     12039
14            Research      F      8439
15            Research      M     12687
16               Sales      F     20854
17               Sales      M     31391

## Q5. What are the average, maximum and mimum salaries across all departments and titles?

In [ ]:
SELECT	
	dept_name,
    title,
    ROUND(AVG(salary), 2) AS Avg_Salary,
    MAX(Salary) AS Max_Salary,
    MIN(Salary) AS Min_Salary
FROM 
    departments
INNER JOIN dept_emp
	USING(dept_no)
INNER JOIN salaries
	USING (emp_no)
INNER JOIN titles
	USING (emp_no)
GROUP BY
	dept_name,title
ORDER BY
	Avg_Salary DESC;

             dept_name               title  Avg_Salary  Max_Salary  Min_Salary
0            Marketing             Manager    88371.69      108407       69941
1                Sales             Manager    85738.76      101987       70787
2                Sales        Senior Staff    81785.50      158220       39237
3                Sales               Staff    80677.92      158220       39169
4             Research             Manager    77535.18      103244       48077
5            Marketing        Senior Staff    73055.06      145128       39217
6            Marketing               Staff    71832.64      145128       39127
7              Finance        Senior Staff    71663.51      142395       38812
8              Finance             Manager    70815.89       88443       52070
9              Finance               Staff    70539.36      142395       39177
10  Quality Management             Manager    67130.94       93193       40055
11    Customer Service     Senior Engineer    60911.32      129468       38963
12          Production     Senior Engineer    60886.09      138273       38872
13            Research        Senior Staff    60841.21      130211       38874
14         Development     Senior Engineer    60718.12      140784       38849
15            Research     Senior Engineer    60617.73      122941       38851
16          Production            Engineer    59858.14      138273       38916
17    Customer Service            Engineer    59845.13      123415       39280
18            Research  Assistant Engineer    59756.66      121683       39507
19    Customer Service        Senior Staff    59689.57      144866       38836
20         Development            Engineer    59683.08      140784       38849
21            Research            Engineer    59673.76      122940       38851
22         Development             Manager    59658.12       74510       40000
23         Development  Assistant Engineer    59626.19      133712       38850
24            Research               Staff    59616.47      130211       38874
25         Development    Technique Leader    59569.39      144434       38888
26          Production    Technique Leader    59555.51      132233       38623
27          Production  Assistant Engineer    59459.42      120910       39265
28    Customer Service    Technique Leader    59160.52      109926       39411
29    Customer Service  Assistant Engineer    58864.11      109572       39553
30            Research    Technique Leader    58807.88      123197       39554
31    Customer Service               Staff    58649.60      144866       38836
32  Quality Management     Senior Engineer    58500.51      123566       38786
33          Production        Senior Staff    58292.78      112264       38836
34     Human Resources             Manager    58286.06       79229       40000
35         Development        Senior Staff    58273.66      118730       39115
36  Quality Management            Engineer    57396.52      123566       38928
37          Production               Staff    57263.05      112264       38836
38  Quality Management  Assistant Engineer    57147.84      115763       39319
39  Quality Management    Technique Leader    57016.22      132103       38932
40         Development               Staff    56866.28      115716       39115
41     Human Resources        Senior Staff    56718.78      141953       38735
42          Production             Manager    56233.40       75121       40000
43     Human Resources               Staff    55629.84      128308       38735
44    Customer Service             Manager    54959.67       73953       40000

## Q6. What is the average salary for each titleholder?

In [ ]:
SELECT
	title,
    ROUND(AVG(salary), 2) AS Avg_Salary
FROM
	salaries
INNER JOIN
	titles
USING (emp_no)
GROUP BY title
ORDER BY Avg_Salary DESC;

                title  Avg_Salary
0        Senior Staff    70470.84
1               Staff    69309.10
2             Manager    66924.27
3     Senior Engineer    60543.22
4            Engineer    59508.04
5  Assistant Engineer    59304.99
6    Technique Leader    59294.37

## Q7. What is the average age of employees within each department?

In [ ]:
SELECT
	d.dept_name AS Department,
	MAX(TIMESTAMPDIFF(Year, e.birth_date, curdate())) AS Max_Age, 					MIN(TIMESTAMPDIFF(Year, e.birth_date, curdate())) AS Min_Age, 			ROUND(AVG(TIMESTAMPDIFF(Year, e.birth_date, curdate())),2) AS Avg_Age
FROM
	departments AS d
INNER JOIN dept_emp AS de
	USING (dept_no)
INNER JOIN employees AS e
	USING (emp_no)
GROUP BY
	Department;

           Department  Max_Age  Min_Age  Avg_Age
0    Customer Service       70       57    63.34
1         Development       70       57    63.32
2             Finance       70       57    63.35
3     Human Resources       70       57    63.36
4           Marketing       70       57    63.34
5          Production       70       57    63.35
6  Quality Management       70       57    63.37
7            Research       70       57    63.33
8               Sales       70       57    63.34

## Q8. Who are the oldest serving employees within the company to-date?

In [ ]:
SELECT 
	emp_no,
    CONCAT(first_name,' ',last_name) AS Full_Name,
	TIMESTAMPDIFF(Day, hire_date, curdate()) AS Service_Period_By_Days,
    hire_date
FROM 
	employees
LEFT JOIN 
	(SELECT emp_no, MAX(to_date) as Max_Date
	FROM titles
	WHERE to_date != curdate()
	GROUP BY emp_no
	) AS Serve_date
	USING (emp_no)
ORDER BY
	Service_Period_By_Days DESC
LIMIT 10;

,emp_no,Full_Name,Service_Period_By_Days,hire_date
0,111692,Tonny Butterworth,13666,1985-01-01 00:00:00+00:00
1,110085,Ebru Alpin,13666,1985-01-01 00:00:00+00:00
2,111035,Przemyslawa Kaelbling,13666,1985-01-01 00:00:00+00:00
3,110511,DeForest Hagimont,13666,1985-01-01 00:00:00+00:00
4,110725,Peternela Onuegbe,13666,1985-01-01 00:00:00+00:00
5,110303,Krassimir Wegerle,13666,1985-01-01 00:00:00+00:00
6,111400,Arie Staelin,13666,1985-01-01 00:00:00+00:00
7,110022,Margareta Markovitch,13666,1985-01-01 00:00:00+00:00
8,110183,Shirish Ossenbruggen,13666,1985-01-01 00:00:00+00:00
9,110114,Isamu Legleitner,13653,1985-01-14 00:00:00+00:00

## Q9. How many employees were hired between 1985 and 2001, and what was the gender diversity of recruitment?

In [ ]:
SELECT
    YEAR(de.from_date) AS Recruitment_Year,
    COUNT(e.emp_no) AS Employees_Hired,
    e.gender
FROM
	dept_emp AS de
INNER JOIN
	employees as e
ON
	de.emp_no = e.emp_no
WHERE
	YEAR(de.from_date) >= "1985"
AND
	YEAR(de.from_date) <= "2001"
GROUP BY
	Recruitment_Year, e.gender
ORDER BY
	Recruitment_Year;

    Recruitment_Year  Employees_Hired gender
0               1985            10992      M
1               1985             7388      F
2               1986            12134      M
3               1986             8020      F
4               1987            12319      M
5               1987             8115      F
6               1988            12362      M
7               1988             8374      F
8               1989            12474      M
9               1989             8569      F
10              1990            12568      M
11              1990             8471      F
12              1991            12727      M
13              1991             8257      F
14              1992            12955      M
15              1992             8593      F
16              1993            12913      M
17              1993             8589      F
18              1994            12877      M
19              1994             8741      F
20              1995            13158      M
21              1995             8750      F
22              1996            13573      M
23              1996             8940      F
24              1997            13672      M
25              1997             9100      F
26              1998            13717      M
27              1998             9216      F
28              1999            14023      M
29              1999             9329      F
30              2000             3160      M
31              2000             2190      F
32              2001             2063      M
33              2001             1408      F

## Q10. What is the men and women ratio at Manager title?

In [ ]:
SELECT
    COUNT(emp_no) AS Employee_Count,
    e.gender,
    t.title
FROM
	titles AS t
INNER JOIN
	employees as e
USING(emp_no)
WHERE
	t.title = "Manager"
GROUP BY
	e.gender;

   Employee_Count gender    title
0              11      M  Manager
1              13      F  Manager

## Q11. Which staff have been employed for the least amount of days?

In [ ]:
SELECT
	TIMESTAMPDIFF(Day, from_date, to_date) AS Days_worked,
    t.emp_no,
    CONCAT(e.first_name,' ',e.last_name) AS Full_Name,
    t.from_date,
    t.to_date
FROM
	titles AS t
INNER JOIN
	employees AS e
USING (emp_no)
GROUP BY
	Days_worked
ORDER BY
	Days_worked
LIMIT 50;

,Days_worked,emp_no,Full_Name,from_date,to_date
0,0,13058,Deborah Jumpertz,2001-07-05 00:00:00+00:00,2001-07-05 00:00:00+00:00
1,1,14807,Miquel Zweizig,1999-02-13 00:00:00+00:00,1999-02-14 00:00:00+00:00
2,2,23261,Wayne Barbanera,1999-10-30 00:00:00+00:00,1999-11-01 00:00:00+00:00
3,3,21304,Serge Cardazo,1997-03-19 00:00:00+00:00,1997-03-22 00:00:00+00:00
4,4,10765,Goetz Norsworthy,1994-05-07 00:00:00+00:00,1994-05-11 00:00:00+00:00
5,5,20554,Qunsheng Shumilov,1999-04-15 00:00:00+00:00,1999-04-20 00:00:00+00:00
6,6,11297,Geraldo Levergood,1991-02-16 00:00:00+00:00,1991-02-22 00:00:00+00:00
7,7,15396,Marek Erva,1995-04-02 00:00:00+00:00,1995-04-09 00:00:00+00:00
8,8,13224,Gladys Dichev,1995-12-09 00:00:00+00:00,1995-12-17 00:00:00+00:00
9,9,13788,Takahira Furedi,1997-04-03 00:00:00+00:00,1997-04-12 00:00:00+00:00
10,10,12974,Gift Frolund,1994-10-24 00:00:00+00:00,1994-11-03 00:00:00+00:00
11,11,15194,Jungsoon Rosar,1990-08-21 00:00:00+00:00,1990-09-01 00:00:00+00:00
12,12,10082,Parviz Lortz,1990-01-03 00:00:00+00:00,1990-01-15 00:00:00+00:00
13,13,12260,Mokhtar Huttel,1991-04-26 00:00:00+00:00,1991-05-09 00:00:00+00:00
14,14,18488,Hongzue Lorcy,1995-08-04 00:00:00+00:00,1995-08-18 00:00:00+00:00
15,15,10316,Christoper Schwaller,1990-12-18 00:00:00+00:00,1991-01-02 00:00:00+00:00
16,16,11484,Holgard Siepmann,1999-10-06 00:00:00+00:00,1999-10-22 00:00:00+00:00
17,17,32664,Charmane Pashtan,1990-02-26 00:00:00+00:00,1990-03-15 00:00:00+00:00
18,18,11131,Weiye Zambonelli,1999-07-14 00:00:00+00:00,1999-08-01 00:00:00+00:00
19,19,30953,Mototsugu Mukaidono,1996-08-02 00:00:00+00:00,1996-08-21 00:00:00+00:00
20,20,10073,Shir McClurg,1998-02-02 00:00:00+00:00,1998-02-22 00:00:00+00:00
21,21,19025,Urs Prenel,1997-12-23 00:00:00+00:00,1998-01-13 00:00:00+00:00
22,22,22044,Petter Bahi,1997-07-22 00:00:00+00:00,1997-08-13 00:00:00+00:00
23,23,41157,Jeanne Valiente,1994-04-20 00:00:00+00:00,1994-05-13 00:00:00+00:00
24,24,27542,Kazuhisa Prampolini,1999-09-03 00:00:00+00:00,1999-09-27 00:00:00+00:00
25,25,14846,Magy Joslin,1997-05-02 00:00:00+00:00,1997-05-27 00:00:00+00:00
26,26,10489,Elvia Homond,1989-09-10 00:00:00+00:00,1989-10-06 00:00:00+00:00
27,27,10985,Chiradeep Furedi,1999-02-11 00:00:00+00:00,1999-03-10 00:00:00+00:00
28,28,16866,Toney Ratnakar,1998-03-17 00:00:00+00:00,1998-04-14 00:00:00+00:00
29,29,14315,Baocai Standera,1999-08-26 00:00:00+00:00,1999-09-24 00:00:00+00:00
30,30,13801,Shih Mayerwieser,1999-05-26 00:00:00+00:00,1999-06-25 00:00:00+00:00
31,31,11145,Jinxi Baak,1999-04-23 00:00:00+00:00,1999-05-24 00:00:00+00:00
32,32,18848,Yaghout Pagter,1995-11-23 00:00:00+00:00,1995-12-25 00:00:00+00:00
33,33,11358,Nevin Petereit,1998-06-02 00:00:00+00:00,1998-07-05 00:00:00+00:00
34,34,26648,Aral Beznosov,1999-09-20 00:00:00+00:00,1999-10-24 00:00:00+00:00
35,35,16726,Alenka Gurbaxani,1994-09-30 00:00:00+00:00,1994-11-04 00:00:00+00:00
36,36,12303,Godehard Braccini,1988-06-13 00:00:00+00:00,1988-07-19 00:00:00+00:00
37,37,39559,Youssef Shobatake,1997-10-26 00:00:00+00:00,1997-12-02 00:00:00+00:00
38,38,17091,Gunilla Merkl,1992-02-11 00:00:00+00:00,1992-03-20 00:00:00+00:00
39,39,15483,Danel Godskesen,1993-09-09 00:00:00+00:00,1993-10-18 00:00:00+00:00
40,40,28494,Luerbio Ratzlaff,2000-11-04 00:00:00+00:00,2000-12-14 00:00:00+00:00
41,41,29553,Paddy Ozery,1998-09-09 00:00:00+00:00,1998-10-20 00:00:00+00:00
42,42,16576,Zhensheng Beidas,1992-03-08 00:00:00+00:00,1992-04-19 00:00:00+00:00
43,43,21147,Ekawit Demir,2002-03-09 00:00:00+00:00,2002-04-21 00:00:00+00:00
44,44,23700,Fun Viele,1993-04-27 00:00:00+00:00,1993-06-10 00:00:00+00:00
45,45,15813,Etsuo Callaway,1997-06-01 00:00:00+00:00,1997-07-16 00:00:00+00:00
46,46,11477,Fox Narahari,1996-07-28 00:00:00+00:00,1996-09-12 00:00:00+00:00
47,47,39802,Yuqun Rodier,1990-09-15 00:00:00+00:00,1990-11-01 00:00:00+00:00
48,48,19135,Leaf Soicher,1986-08-21 00:00:00+00:00,1986-10-08 00:00:00+00:00
49,49,51304,Yoshinari Bugrara,1996-01-28 00:00:00+00:00,1996-03-17 00:00:00+00:00